# Data inspection and cleaning 

## This Jupyter notebook will be used to explain and keep information regarding the data housed in salary_daya.db

### Initial inspection

This will display data types and any null values. Potential issues within the data and proper types within the data. This is the first step of cleaning the data.

In [5]:
import pandas as pd
import os

# CSV path
csv_path = "Salary_Data.csv"

# Check if the file exists
if not os.path.exists(csv_path):
    raise FileNotFoundError(f"CSV file not found at {csv_path}")

# Load CSV into DataFrame
df = pd.read_csv(csv_path)

print(f"\n‚úÖ Data successfully loaded. Shape: {df.shape[0]} rows √ó {df.shape[1]} columns")

# --- STRUCTURAL INSPECTION ---

# 1Ô∏è‚É£ DataFrame info (types, null counts)
print("\n=== DataFrame Info ===")
df.info()

# 2Ô∏è‚É£ Numeric summary
print("\n=== Descriptive Statistics (Numeric Columns) ===")
display(df.describe())

# 3Ô∏è‚É£ Data types
print("\n=== Column Data Types ===")
display(df.dtypes)

# 4Ô∏è‚É£ Number of unique values per column
print("\n=== Number of Unique Values per Column ===")
unique_counts = df.nunique()
display(unique_counts)

# 5Ô∏è‚É£ Peek at the data
print("\n=== First 10 Rows ===")
display(df.head(10))

print("\n=== Random 10 Rows ===")
display(df.sample(10, random_state=1))

# 6Ô∏è‚É£ Optional: top values for categorical columns
print("\n=== Top Values for Categorical Columns ===")
for col in df.select_dtypes(include='object').columns:
    print(f"\nColumn: {col}")
    print(df[col].value_counts().head(5))

‚úÖ Data successfully loaded. Shape: 6704 rows √ó 6 columns

=== DataFrame Info ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

=== Descriptive Statistics (Numeric Columns) ===

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

=== Column Data Types ===

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

=== Number of Unique Values per Column ===

Age                     41
Gender                   3
Education Level          7
Job Title              193
Years of Experience     37
Salary                 444
dtype: int64

=== First 10 Rows ===

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

=== Random 10 Rows ===

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2192,33.0,Male,Bachelor's Degree,Full Stack Engineer,7.0,130000.0
2544,23.0,Female,High School,Back end Developer,2.0,62807.0
2328,41.0,Female,PhD,Director of Data Science,16.0,200000.0
4032,43.0,Male,PhD,Data Scientist,16.0,160000.0
5759,29.0,Male,Bachelor's Degree,Product Manager,5.0,80000.0
1615,43.0,Male,PhD,Senior Project Engineer,13.0,185000.0
4605,27.0,Female,Bachelor's Degree,Web Developer,2.0,50000.0
2740,42.0,Male,Master's Degree,Product Manager,14.0,180000.0
1163,30.0,Male,Master's,Software Engineer,6.0,170000.0
3067,54.0,Male,Bachelor's Degree,Full Stack Engineer,25.0,179756.0

=== Top Values for Categorical Columns ===

Column: Gender
Gender
Male      3674
Female    3014
Other       14
Name: count, dtype: int64

Column: Education Level
Education Level
Bachelor's Degree    2267
Master's Degree      1573
PhD                  1368
Bachelor's            756
High School           448
Name: count, dtype: int64

Column: Job Title
Job Title
Software Engineer            518
Data Scientist               453
Software Engineer Manager    376
Data Analyst                 363
Senior Project Engineer      318
Name: count, dtype: int64

### Observations after inspection

1. Data is extremely clean but after reflection easiest path forward is to drop missing values as dropping so few values does not effect the effectiveness of the dataset but avoids potential errors in the future.
2. Education level needs cleaning. Bacholer's degree and Bachelor's should be the same. Master's Degree and Master's should be the same. Intial inspection only showed top results after those adjustments I will inspect again.
3. Data is proven to be very good for analysis once cleaning is complete

In [6]:
# --- DATA CLEANING ---

# 1Ô∏è‚É£ Strip whitespace from column names
df.columns = df.columns.str.strip()

# 2Ô∏è‚É£ Strip whitespace from string columns
str_cols = df.select_dtypes(include='object').columns
df[str_cols] = df[str_cols].apply(lambda x: x.str.strip())

# 3Ô∏è‚É£ Convert numeric columns to proper numbers (strip any whitespace)
numeric_cols = ['Age', 'Salary', 'YearsExperience']  # add any other numeric columns
for col in numeric_cols:
    if col in df.columns:
        df[col] = pd.to_numeric(df[col].astype(str).str.strip(), errors='coerce')

print("\n=== Handling Missing Values ===")
# Count missing values before cleaning
print("\nMissing values per column (before):")
print(df.isna().sum())

# Drop rows with any missing values
df_clean = df.dropna()

# Confirm results
print("\nMissing values per column (after):")
print(df_clean.isna().sum())
print(f"\n‚úÖ Cleaned DataFrame shape: {df_clean.shape[0]} rows √ó {df_clean.shape[1]} columns")

# --- STANDARDIZE EDUCATION LEVELS ---
print("\n=== Standardizing 'Education Level' values ===")
education_replacements = {
    "Bachelor's Degree": "Bachelor's",
    "Master's Degree": "Master's",
    "phD": "PhD"
}
df_clean['Education Level'] = df_clean['Education Level'].replace(education_replacements)

# Optional: verify changes
print("\nUnique values in 'Education Level' after cleaning:")
print(df_clean['Education Level'].unique())

# --- SAVE CLEANED DATA ---
cleaned_path = "Salary_Data_Cleaned.csv"
df_clean.to_csv(cleaned_path, index=False)
print(f"\nüíæ Cleaned data saved to: {os.path.abspath(cleaned_path)}")

=== Handling Missing Values ===

Missing values per column (before):
Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

Missing values per column (after):
Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

‚úÖ Cleaned DataFrame shape: 6698 rows √ó 6 columns

=== Standardizing 'Education Level' values ===

Unique values in 'Education Level' after cleaning:
["Bachelor's" "Master's" 'PhD' 'High School']

üíæ Cleaned data saved to: /Users/craigwilcox/Projects/salary-experience-wilcox/data/Salary_Data_Cleaned.csv

/var/folders/vt/1glhq4pd72s2pq4r1wl_lx840000gn/T/ipykernel_89028/2562062549.py:36: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['Education Level'] = df_clean['Education Level'].replace(education_replacements)

In [7]:
# Path to the cleaned dataset
csv_path = "Salary_Data_Cleaned.csv"

# Check if the file exists
if not os.path.exists(csv_path):
    raise FileNotFoundError(f"Cleaned CSV file not found at {csv_path}")

# Load cleaned CSV
df_cleaned = pd.read_csv(csv_path)

print(f"\n‚úÖ Cleaned data successfully loaded. Shape: {df_cleaned.shape[0]} rows √ó {df_cleaned.shape[1]} columns")

# --- STRUCTURAL INSPECTION ---

print("\n=== DataFrame Info ===")
df_cleaned.info()

print("\n=== Descriptive Statistics (Numeric Columns) ===")
display(df_cleaned.describe())

print("\n=== Column Data Types ===")
display(df_cleaned.dtypes)

print("\n=== Number of Unique Values per Column ===")
display(df_cleaned.nunique())

print("\n=== First 10 Rows ===")
display(df_cleaned.head(10))

print("\n=== Random 10 Rows ===")
display(df_cleaned.sample(10, random_state=1))

print("\n=== Top Values for Categorical Columns ===")
for col in df_cleaned.select_dtypes(include='object').columns:
    print(f"\nColumn: {col}")
    print(df_cleaned[col].value_counts().head(5))

‚úÖ Cleaned data successfully loaded. Shape: 6698 rows √ó 6 columns

=== DataFrame Info ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6698 entries, 0 to 6697
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6698 non-null   float64
 1   Gender               6698 non-null   object
 2   Education Level      6698 non-null   object
 3   Job Title            6698 non-null   object
 4   Years of Experience  6698 non-null   float64
 5   Salary               6698 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.1+ KB

=== Descriptive Statistics (Numeric Columns) ===

               Age  Years of Experience         Salary
count  6698.000000          6698.000000    6698.000000
mean     33.623022             8.095178  115329.253061
std       7.615784             6.060291   52789.792507
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

=== Column Data Types ===

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

=== Number of Unique Values per Column ===

Age                     41
Gender                   3
Education Level          4
Job Title              191
Years of Experience     37
Salary                 444
dtype: int64

=== First 10 Rows ===

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,42.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0

=== Random 10 Rows ===

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2188,46.0,Female,PhD,Senior Project Engineer,16.0,185000.0
4369,41.0,Female,Master's,Marketing Coordinator,13.0,131000.0
5627,24.0,Female,Bachelor's,Marketing Analyst,0.0,40000.0
4974,30.0,Male,Master's,Financial Manager,7.0,120000.0
687,32.0,Female,PhD,Data Scientist,9.0,195000.0
608,29.0,Male,Bachelor's,Software Engineer,6.0,170000.0
5364,25.0,Female,High School,Sales Associate,0.0,25000.0
6094,34.0,Male,PhD,Research Director,12.0,170000.0
6141,32.0,Female,PhD,Data Scientist,9.0,145000.0
1687,35.0,Male,Bachelor's,Full Stack Engineer,8.0,145000.0

=== Top Values for Categorical Columns ===

Column: Gender
Gender
Male      3671
Female    3013
Other       14
Name: count, dtype: int64

Column: Education Level
Education Level
Bachelor's     3021
Master's       1860
PhD            1369
High School     448
Name: count, dtype: int64

Column: Job Title
Job Title
Software Engineer            518
Data Scientist               453
Software Engineer Manager    376
Data Analyst                 363
Senior Project Engineer      318
Name: count, dtype: int64

Data has been cleaned running one more query to check all unique job titles.

In [8]:
pd.set_option('display.max_rows', None)
print(df_cleaned['Job Title'].value_counts())
pd.reset_option('display.max_rows')

Job Title
Software Engineer                        518
Data Scientist                           453
Software Engineer Manager                376
Data Analyst                             363
Senior Project Engineer                  318
Product Manager                          313
Full Stack Engineer                      308
Marketing Manager                        255
Senior Software Engineer                 244
Back end Developer                       244
Front end Developer                      241
Marketing Coordinator                    158
Junior Sales Associate                   142
Financial Manager                        134
Marketing Analyst                        132
Software Developer                       125
Operations Manager                       114
Human Resources Manager                  104
Director of Marketing                     88
Web Developer                             87
Product Designer                          75
Research Director                         75
Content Marketing Manager                 73
Sales Associate                           70
Director of HR                            69
Senior Product Marketing Manager          69
Research Scientist                        69
Marketing Director                        64
Sales Director                            62
Senior Data Scientist                     61
Junior HR Generalist                      60
Junior Software Developer                 58
Director of Data Science                  57
Receptionist                              57
Sales Manager                             56
Digital Marketing Manager                 52
Junior Marketing Manager                  51
Junior Software Engineer                  51
Senior Research Scientist                 49
Human Resources Coordinator               49
Senior Human Resources Manager            48
Senior HR Generalist                      42
Junior Web Developer                      42
Junior Sales Representative               41
Financial Analyst                         39
Sales Representative                      38
Sales Executive                           38
Front End Developer                       31
Junior HR Coordinator                     29
Junior Data Analyst                       25
Graphic Designer                          22
Project Manager                           22
Digital Marketing Specialist              15
Social Media Manager                      14
Director of Operations                    11
Senior Business Analyst                   10
Senior Marketing Manager                   9
Senior Marketing Analyst                   9
Junior Business Analyst                    8
Senior Financial Analyst                   7
Junior Business Development Associate      7
Senior Project Manager                     7
Junior Financial Analyst                   7
Junior Marketing Coordinator               6
Senior Product Manager                     6
Customer Service Representative            6
Senior Operations Manager                  5
Senior Financial Manager                   5
Junior Operations Analyst                  5
Senior Product Designer                    5
Delivery Driver                            5
Senior Project Coordinator                 5
Junior Project Manager                     5
Junior Marketing Specialist                5
Senior Operations Coordinator              4
Senior Business Development Manager        4
Senior Data Engineer                       4
Junior Product Manager                     4
Senior Marketing Specialist                4
Senior Marketing Coordinator               3
Juniour HR Generalist                      3
Senior Financial Advisor                   3
Junior Operations Manager                  3
Junior Accountant                          3
Senior Scientist                           3
Senior UX Designer                         3
Senior Data Analyst                        3
Juniour HR Coordinator                     3
Senior HR Manager                          3
Junior Marketing Analyst                   3
Senior Software Developer                  3
Senior IT Consultant                       2
Senior Sales Representative                2
Director of Finance                        2
Senior Operations Analyst                  2
HR Manager                                 2
Senior Manager                             2
Recruiter                                  2
Business Analyst                           2
Junior Business Operations Analyst         2
Director of Human Resources                2
Director of Engineering                    2
Senior Sales Manager                       2
Senior Accountant                          2
Junior Account Manager                     2
Event Coordinator                          2
Customer Service Manager                   2
HR Generalist                              2
Senior Engineer                            2
Administrative Assistant                   2
Operations Director                        1
Marketing Specialist                       1
VP of Operations                           1
Data Entry Clerk                           1
Social Media Specialist                    1
Software Manager                           1
Junior Developer                           1
Customer Service Rep                       1
Director                                   1
IT Support                                 1
CEO                                        1
Senior Consultant                          1
UX Designer                                1
Network Engineer                           1
Strategy Consultant                        1
Copywriter                                 1
Account Manager                            1
Business Development Manager               1
IT Manager                                 1
VP of Finance                              1
UX Researcher                              1
Business Intelligence Analyst              1
Help Desk Analyst                          1
Technical Writer                           1
Accountant                                 1
Customer Success Rep                       1
Project Engineer                           1
Supply Chain Analyst                       1
Chief Data Officer                         1
Digital Content Producer                   1
Principal Engineer                         1
Software Project Manager                   1
Junior Web Designer                        1
Supply Chain Manager                       1
Principal Scientist                        1
Junior Designer                            1
Financial Advisor                          1
Chief Technology Officer                   1
Technical Support Specialist               1
Human Resources Director                   1
Training Specialist                        1
Product Marketing Manager                  1
Operations Analyst                         1
Public Relations Manager                   1
Senior Graphic Designer                    1
Customer Success Manager                   1
IT Support Specialist                      1
Technical Recruiter                        1
Creative Director                          1
Junior Customer Support Specialist         1
Senior IT Support Specialist               1
Junior Recruiter                           1
Director of Sales                          1
Office Manager                             1
Sales Operations Manager                   1
Senior Training Specialist                 1
Senior Marketing Director                  1
Senior IT Project Manager                  1
Senior Quality Assurance Analyst           1
Director of Sales and Marketing            1
Director of Product Management             1
Senior Account Manager                     1
Senior Researcher                          1
Junior Data Scientist                      1
Senior Human Resources Coordinator         1
Junior Copywriter                          1
Junior UX Designer                         1
Junior Advertising Coordinator             1
Director of Human Capital                  1
Junior Social Media Manager                1
Senior Human Resources Specialist          1
Senior Account Executive                   1
Director of Business Development           1
Junior Financial Advisor                   1
Junior Operations Coordinator              1
Senior HR Specialist                       1
Junior Research Scientist                  1
Senior Product Development Manager         1
Junior Social Media Specialist             1
Senior Software Architect                  1
Social Media Man                           1
Name: count, dtype: int64

This will be used later during analysis